import React from "react";
import Select from "react-select";

const options = [
  { label: "قطاع الأمن المركزى", value: "قطاع الأمن المركزى" },
  { label: "قطاع الأحوال المدنية", value: "قطاع الأحوال المدنية" },
  { label: "قطاع الأمن المركزى", value: "قطاع الأمن المركزى" },
  { label: "قطاع الأحوال المدنية", value: "قطاع الأحوال المدنية" },
  { label: "قطاع الحماية المجتمعية", value: "قطاع الحماية المجتمعية" },
  { label: "الادارة العامة للتدريب", value: "الادارة العامة للتدريب" },
  { label: "أكاديمية الشرطة", value: "أكاديمية الشرطة" },
  { label: "ا.ع لمعاهد معاوني الأمن", value: "ا.ع لمعاهد معاوني الأمن" },
  { label: "ا.ع للأمانة العامة", value: "ا.ع للأمانة العامة" },
  { label: "ا.ع للمرور", value: "ا.ع للمرور" },
  { label: "ا.ع للأسلحة والذخيرة", value: "ا.ع للأسلحة والذخيرة" },
  { label: "ا.ع لتصاريح العمل", value: "ا.ع لتصاريح العمل" },
  { label: "ا.ع لأمن المواني", value: "ا.ع لأمن المواني" },
  { label: "ا.ع لإتصالات الشرطة", value: "ا.ع لإتصالات الشرطة" },
  {
    label: "ا.ع لتأمين محور قناة السويس",
    value: "ا.ع لتأمين محور قناة السويس",
  },
  { label: "ا.ع لشرطة الكهرباء", value: "ا.ع لشرطة الكهرباء" },
  { label: "ا.ع لتدريب قوات الأمن", value: "ا.ع لتدريب قوات الأمن" },
  { label: "ا.ع للحماية المدنية", value: "ا.ع للحماية المدنية" },
  {
    label: "ا.ع للجوازات والهجرة والجنسية",
    value: "ا.ع للجوازات والهجرة والجنسية",
  },
  {
    label: "ا.ع لمباحث الضرائب و الرسوم ",
    value: "ا.ع لمباحث الضرائب و الرسوم",
  },
  { label: "ا.ع لأندية وفنادق الشرطة", value: "ا.ع لأندية وفنادق الشرطة" },
  { label: "ا.ع للشئون الادارية", value: "ا.ع للشئون الادارية" },
  { label: "ا.ع لشرطة النقل والمواصلات", value: "ا.ع لشرطة النقل والمواصلات" },
  {
    label: "ا.ع لشرطة التعمير المجتمعات العمرانية الجديدة",
    value: "ا.ع لشرطة التعمير المجتمعات العمرانية الجديدة",
  },
  { label: "ا.ع لمكافحة المخدرات", value: "ا.ع لمكافحة المخدرات" },
  { label: "ا.ع لشئون المجندين", value: "ا.ع لشئون المجندين" },
  { label: "ا.ع لامداد الشرطة", value: "ا.ع لامداد الشرطة" },
  { label: " ا.ع لمركبات الشرطة", value: " ا.ع لمركبات الشرطة" },
  { label: "ا.ع لميناء القاهرة الجوي", value: "ا.ع لميناء القاهرة الجوي" },
  {
    label: "ا.ع لشرطة ميناء الإسكندرية البحري",
    value: "ا.ع لشرطة ميناء الإسكندرية البحري",
  },
  { label: "ا.ع لشرطة الحراسات الخاصة", value: "ا.ع لشرطة الحراسات الخاصة" },
  { label: "ا.ع لمجلسي النواب والشيوخ", value: "ا.ع لمجلسي النواب والشيوخ" },
  { label: "قطاع السياحة والآثار", value: "قطاع السياحة والآثار" },
  { label: "قطاع الخدمات الطبية", value: "قطاع الخدمات الطبية" },
  { label: "قطاع الأفراد", value: "قطاع الأفراد" },
  {
    label: "ا. ع لشرطة البيئة والمسطحات",
    value: "ا. ع لشرطة البيئة والمسطحات",
  },
  { label: "ا. ع لإتحاد الشرطة الرياضي", value: "ا. ع لإتحاد الشرطة الرياضي" },
  { label: "ا. ع لشئون الأمانة العامة", value: "ا. ع لشئون الأمانة العامة" },
  { label: "قطاع الأمن العام", value: "قطاع الأمن العام" },
  { label: "ا. ع لنظم معلومات المرور", value: "ا. ع لنظم معلومات المرور" },
  { label: "قطاع أمن القاهرة", value: "قطاع أمن القاهرة" },
  { label: "قطاع أمن الجيزة", value: "قطاع أمن الجيزة" },
  { label: "مديرية أمن القاهرة", value: "مديرية أمن القاهرة" },
  { label: "مديرية أمن الجيزة", value: "مديرية أمن الجيزة" },
  { label: "مديرية أمن الشرقية", value: "مديرية أمن الشرقية" },
  { label: "مديرية أمن القليوبية", value: "مديرية أمن القليوبية" },
  { label: "مديرية أمن الغربية", value: "مديرية أمن الغربية" },
  { label: "مديرية أمن البحيرة", value: "مديرية أمن البحيرة" },
  { label: "مديرية أمن الاسكندرية", value: "مديرية أمن الاسكندرية" },
  { label: "مديرية أمن كفر الشيخ", value: "مديرية أمن كفر الشيخ" },
  { label: "مديرية أمن مطروح", value: "مديرية أمن مطروح" },
  { label: "مديرية أمن دمياط", value: "مديرية أمن دمياط" },
  { label: "مديرية أمن المنوفية", value: "مديرية أمن المنوفية" },
  { label: "مديرية أمن الدقهلية", value: "مديرية أمن الدقهلية" },
  { label: "مديرية أمن بورسعيد", value: "مديرية أمن بورسعيد" },
  { label: "مديرية أمن الاسماعيلية", value: "مديرية أمن الاسماعيلية" },
  { label: "مديرية أمن السويس", value: "مديرية أمن السويس" },
  { label: "مديرية أمن شمال سيناء", value: "مديرية أمن شمال سيناء" },
  { label: "مديرية أمن جنوب سيناء", value: "مديرية أمن جنوب سيناء" },
  { label: "مديرية أمن البحر الأحمر", value: "مديرية أمن البحر الأحمر" },
  { label: "مديرية أمن الفيوم", value: "مديرية أمن الفيوم" },
  { label: "مديرية أمن بني سويف", value: "مديرية أمن بني سويف" },
  { label: "مديرية أمن المنيا", value: "مديرية أمن المنيا" },
  { label: "مديرية أمن أسيوط", value: "مديرية أمن أسيوط" },
  { label: "مديرية أمن سوهاج", value: "مديرية أمن سوهاج" },
  { label: "مديرية أمن قنا", value: "مديرية أمن قنا" },
  { label: "مديرية أمن الأقصر", value: "مديرية أمن الأقصر" },
  { label: "مديرية أمن أسوان", value: "مديرية أمن أسوان" },
  { label: "مديرية أمن الوادي الجديد", value: "مديرية أمن الوادي الجديد" },
];

const EntityDropdown = ({ value, onChange }) => {
  const customStyles = {
    control: (provided) => ({
      ...provided,
      borderRadius: 0, // Customize styles here
    }),
    // Add more custom styles as needed
  };

  return (
    <Select
      required
      options={options}
      value={options.filter((option) => option.value === value)}
      onChange={(selectedOption) => onChange(selectedOption.value)}
      styles={customStyles}
      placeholder="اختر جهة العمل"
      isSearchable
      isRtl // Right-to-left text direction
    />
  );
};

export default EntityDropdown;
